# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [2]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [10]:
cur.execute("""SELECT *
               FROM employees
               JOIN offices
               USING(officeCode)
               WHERE city = 'Boston'
            ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143,Sales Rep,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
1,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143,Sales Rep,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [15]:
cur.execute("""SELECT offices.officeCode, offices.city, COUNT(employees.employeeNumber) AS n_employees
                FROM offices
                LEFT JOIN employees
                USING(officeCode)
                GROUP BY officeCode
                HAVING n_employees = 0
               ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

   officeCode    city  n_employees
0          27  Boston            0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [16]:
# How many customer did each employee have?

cur.execute("""SELECT employees.employeeNumber, employees.firstName, employees.LastName, COUNT(customers.customerNumber) AS employee_sales
               FROM employees
               JOIN customers
               ON employees.employeeNumber = customers.salesRepEmployeeNumber
               GROUP BY employees.employeeNumber
            ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

   employeeNumber firstName   lastName  employee_sales
0            1165    Leslie   Jennings               6
1            1166    Leslie   Thompson               6
2            1188     Julie   Firrelli               6
3            1216     Steve  Patterson               6
4            1286  Foon Yue      Tseng               7

In [ ]:
# Which product was sold most?

In [21]:
cur.execute("""SELECT *
               FROM products
               LEFT JOIN orderDetails
               USING(productCode)
               ORDER BY quantityOrdered DESC
            ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP,orderNumber,quantityOrdered,priceEach,orderLineNumber
0,S12_4675,1969 Dodge Charger,Classic Cars,1:12,Welly Diecast Productions,Detailed model of the 1969 Dodge Charger. This...,7323,58.73,115.16,10405.0,97.0,115.16,5.0
1,S18_3278,1969 Dodge Super Bee,Classic Cars,1:18,Min Lin Diecast,"This replica features opening doors, superb de...",1917,49.05,80.41,10404.0,90.0,67.54,6.0
2,S700_2466,America West Airlines B757-200,Planes,1:700,Motor City Art Classics,Official logos and insignias. Working steering...,9653,68.80,99.72,10401.0,85.0,98.72,10.0
3,S12_3990,1970 Plymouth Hemi Cuda,Classic Cars,1:12,Studio M Art Models,Very detailed 1970 Plymouth Cuda model in 1:12...,5663,31.92,79.80,10404.0,77.0,67.03,4.0
4,S700_3167,F/A 18 Hornet 1/72,Planes,1:72,Motor City Art Classics,"10"" Wingspan with retractable landing gears.Co...",551,54.40,80.00,10401.0,77.0,73.60,9.0

## Level Up: Display the names of every individual product that each employee has sold

In [ ]:
cur.execute("""SELECT productName 
               FROM products
               LEFT JOIN orderDetails
               USING(productCode)
               ORDER BY quantityOrdered DESC
            ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

## Level Up: Display the Number of Products each employee has sold

In [ ]:
# Your code here

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!